000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БанковскийКредит</name>
      <description>Банковский кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаКартойИнтернетЗаказа</name>
      <description>Оплата картой интернет заказа</description>
    </items>
    <items>
      <name>ОплатаПлатежнойКартой</name>
      <description>Оплата платежной картой</description>
    </items>
    <items>
      <name>ОплатаПодарочнымСертификатом</name>
      <description>Оплата подарочным сертификатом</description>
    </items>
    <items>
      <name>Послеплата</name>
      <description>Пiсляплата</description>
    </items>
    <items>
      <name>Предоплата</name>
      <description>Передплата</description>
    </items>
  </predefined>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты_ПРРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Послеплата</name>
    <comment>Только для интернет-магазина.</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыОплатЧекаККМ/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	УправлениеЭлементамиФормыНаСервере();
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ДополнительныеОтчетыИОбработки
	
	ИспользоватьОплатуБанковскимиКредитами = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуБанковскимиКредитами");
	
	Если НЕ ИспользоватьОплатуБанковскимиКредитами И НЕ Объект.Предопределенный Тогда
	
		УдаляемыйЭлемент = Элементы.ТипОплаты.СписокВыбора.НайтиПоЗначению(Перечисления.ТипыОплатЧекаККМ.БанковскийКредит);
		
		Если НЕ УдаляемыйЭлемент = Неопределено Тогда
			Элементы.ТипОплаты.СписокВыбора.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьОплатуПлатежнымиКартами = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуПлатежнымиКартами");
	
	Если НЕ ИспользоватьОплатуПлатежнымиКартами Тогда
	
		УдаляемыйЭлемент = Элементы.ТипОплаты.СписокВыбора.НайтиПоЗначению(Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта);
		
		Если НЕ УдаляемыйЭлемент = Неопределено Тогда
			Элементы.ТипОплаты.СписокВыбора.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормыНаКлиенте();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ТипОплатыПриИзменении(Элемент)
	
	УправлениеЭлементамиФормыНаКлиенте();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
	
	Элементы.ТипОплаты.Доступность = НЕ Объект.Предопределенный ИЛИ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормыНаКлиенте()
	
	Если Объект.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БанковскийКредит") Тогда
		
		Элементы.ГруппаБанковскийКредит.ТекущаяСтраница = Элементы.БанковскийКредит;
		
	Иначе
		
		Элементы.ГруппаБанковскийКредит.ТекущаяСтраница = Элементы.Пустышка;
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
